### Terraform Initialization `success`

### Terraform Validation `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

### Terraform Plan `failure`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
  + create

Terraform planned the following actions, but then encountered a problem:

  # google_storage_bucket_object.version[0] will be created
  + resource "google_storage_bucket_object" "version" {
      + bucket         = "renauto-prod-iac-core-outputs-0"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + md5hexhash     = (known after apply)
      + media_link     = (known after apply)
      + name           = "versions/2-security-version.txt"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "fast_version.txt"
      + storage_class  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "locations" but a value was

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Value for undeclared variable

The root module does not declare a variable named "organization" but a value

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Values for undeclared variables

In addition to the other similar warnings shown, 9 other variable(s) defined
Error: Invalid index

  on main.tf line 55, in module "project":
  55:     var.folder_ids["security-${each.key}"], var.folder_ids.security
    ├────────────────
    │ each.key is "preprod"
    │ var.folder_ids is object with 3 attributes

The given key does not identify an element in this collection value.

```

</details>

### Terraform Apply `skipped`

*Pusher: @Sofiane-Truman, Action: `pull_request`, Working Directory: ``, Workflow: `FAST security stage`*